data = {'birds': ['Cranes', 'Cranes', 'plovers', 'spoonbills', 'spoonbills', 'Cranes', 'plovers', 'Cranes', 'spoonbills', 'spoonbills'], 'age': [3.5, 4, 1.5, np.nan, 6, 3, 5.5, np.nan, 8, 4], 'visits': [2, 4, 3, 4, 3, 4, 2, 2, 3, 2], 'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']}

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

In [1]:
import numpy as np
import pandas as pd
data=pd.DataFrame({"birds":['Cranes', 'Cranes', 'plovers', 'spoonbills', 'spoonbills', 'Cranes', 'Plovers', 'Cranes', 'Spoonbills', 'spoonbills'], "age":[3.5, 4, 1.5, np.nan, 6, 3, 5.5, np.nan, 8, 4], 'visits': [2, 4, 3, 4, 3, 4, 2, 2, 3, 2],
       'priority':['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no'], 
       "labels":['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']})

In [2]:
print(data)

        birds  age  visits priority labels
0      Cranes  3.5       2      yes      a
1      Cranes  4.0       4      yes      b
2     plovers  1.5       3       no      c
3  spoonbills  NaN       4      yes      d
4  spoonbills  6.0       3       no      e
5      Cranes  3.0       4       no      f
6     Plovers  5.5       2       no      g
7      Cranes  NaN       2      yes      h
8  Spoonbills  8.0       3       no      i
9  spoonbills  4.0       2       no      j

In [3]:
data.head(5)

        birds  age  visits priority labels
0      Cranes  3.5       2      yes      a
1      Cranes  4.0       4      yes      b
2     plovers  1.5       3       no      c
3  spoonbills  NaN       4      yes      d
4  spoonbills  6.0       3       no      e

# Basic Sanity Checks

In [4]:
print(data.describe())
print('Birds count')
data['birds'].value_counts()

            age     visits
count  8.000000  10.000000
mean   4.437500   2.900000
std    2.007797   0.875595
min    1.500000   2.000000
25%    3.375000   2.000000
50%    4.000000   3.000000
75%    5.625000   3.750000
max    8.000000   4.000000
Birds count

Cranes        4
spoonbills    3
Spoonbills    1
Plovers       1
plovers       1
Name: birds, dtype: int64

In [5]:
#data.head(2)
data[0:2]

    birds  age  visits priority labels
0  Cranes  3.5       2      yes      a
1  Cranes  4.0       4      yes      b

# print Birds and age

In [6]:
data[['birds','age']]

        birds  age
0      Cranes  3.5
1      Cranes  4.0
2     plovers  1.5
3  spoonbills  NaN
4  spoonbills  6.0
5      Cranes  3.0
6     Plovers  5.5
7      Cranes  NaN
8  Spoonbills  8.0
9  spoonbills  4.0

 # select [2, 3, 7] rows and in columns ['birds', 'age', 'visits']

In [7]:
print(data.loc[[2,3,7]][['birds','age', 'visits']])

        birds  age  visits
2     plovers  1.5       3
3  spoonbills  NaN       4
7      Cranes  NaN       2

# No.of visits lessthan 4

In [8]:
no_visits_four=data[data['visits']<=4]
no_visits_four

        birds  age  visits priority labels
0      Cranes  3.5       2      yes      a
1      Cranes  4.0       4      yes      b
2     plovers  1.5       3       no      c
3  spoonbills  NaN       4      yes      d
4  spoonbills  6.0       3       no      e
5      Cranes  3.0       4       no      f
6     Plovers  5.5       2       no      g
7      Cranes  NaN       2      yes      h
8  Spoonbills  8.0       3       no      i
9  spoonbills  4.0       2       no      j

# select the rows with columns ['birds', 'visits'] where the age is missing i.e NaN

In [9]:
x=data[data['age'].isnull()]
print(x[['birds', 'visits']])

        birds  visits
3  spoonbills       4
7      Cranes       2

# Select the rows where the birds is a Cranes and the age is less than 4

In [10]:
dc=data[[data['birds']=='Cranes'] and data['age']<4]
print(dc[['birds','age']])

     birds  age
0   Cranes  3.5
2  plovers  1.5
5   Cranes  3.0

# Select the rows the age is between 2 and 4(inclusive)

In [11]:
da=data[[data['age']>2] and data['age']<4]
da

     birds  age  visits priority labels
0   Cranes  3.5       2      yes      a
2  plovers  1.5       3       no      c
5   Cranes  3.0       4       no      f

# Find the total number of visits of the bird Cranes

In [12]:
dv=data[data['birds']=='Cranes']
dv['visits'].sum()

12

# Calculate the mean age for each different birds in dataframe.

In [13]:
data[['age', 'birds']]

   age       birds
0  3.5      Cranes
1  4.0      Cranes
2  1.5     plovers
3  NaN  spoonbills
4  6.0  spoonbills
5  3.0      Cranes
6  5.5     Plovers
7  NaN      Cranes
8  8.0  Spoonbills
9  4.0  spoonbills

In [14]:
ab=data.groupby('birds')
print(ab)
for bird,dat in ab:
    print("Mean of bird", bird, "is", dat['age'].mean())

<pandas.core.groupby.generic.DataFrameGroupBy object at 0x0000014F625F4388>
Mean of bird Cranes is 3.5
Mean of bird Plovers is 5.5
Mean of bird Spoonbills is 8.0
Mean of bird plovers is 1.5
Mean of bird spoonbills is 5.0

# Append a new row 'k' to dataframe with your choice of values for each column. Then delete that row to return the original DataFrame.

In [15]:
print(data.columns)
data=data.append({'age':3, 'birds':"rabbit", 'lables':"k", 'priority':"yes", 'visits':"4"},ignore_index=True)
data
print('**********************')

Index(['birds', 'age', 'visits', 'priority', 'labels'], dtype='object')
**********************

In [16]:
dpr=data.tail(1).index.item()
dps=data.drop(dpr)
dps

C:\Users\sridh\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: `item` has been deprecated and will be removed in a future version
  """Entry point for launching an IPython kernel.

        birds  age visits priority labels lables
0      Cranes  3.5      2      yes      a    NaN
1      Cranes  4.0      4      yes      b    NaN
2     plovers  1.5      3       no      c    NaN
3  spoonbills  NaN      4      yes      d    NaN
4  spoonbills  6.0      3       no      e    NaN
5      Cranes  3.0      4       no      f    NaN
6     Plovers  5.5      2       no      g    NaN
7      Cranes  NaN      2      yes      h    NaN
8  Spoonbills  8.0      3       no      i    NaN
9  spoonbills  4.0      2       no      j    NaN

# Find the number of each type of birds in dataframe (Counts)**

In [17]:
data['birds'].value_counts()

Cranes        4
spoonbills    3
Spoonbills    1
rabbit        1
Plovers       1
plovers       1
Name: birds, dtype: int64

# Sort dataframe (birds) by the values in the 'age' and 'visits'  in decending order

In [37]:

dsc_age=data.sort_values(by=['age', 'visits'], ascending=False)
print(dsc_age)

         birds  age visits priority labels lables
8   Spoonbills  8.0      3       no      i    NaN
4   spoonbills  6.0      3       no      e    NaN
6      Plovers  5.5      2       no      g    NaN
1       Cranes  4.0      4      yes      b    NaN
9   spoonbills  4.0      2       no      j    NaN
0       Cranes  3.5      2      yes      a    NaN
10      rabbit  3.0      4      yes    NaN      k
5       Cranes  3.0      4       no      f    NaN
2      plovers  1.5      3       no      c    NaN
3   spoonbills  NaN      4      yes      d    NaN
7       Cranes  NaN      2      yes      h    NaN

In [39]:
dsc_age['visits']

8     3
4     3
6     2
1     4
9     2
0     2
10    4
5     4
2     3
3     4
7     2
Name: visits, dtype: object

# **15. Replace the priority column values with'yes' should be 1 and 'no' should be 0**

In [40]:
data['priority']=data['priority'].apply(lambda value:1 if value=='yes' else 0)
data

         birds  age visits  priority labels lables
0       Cranes  3.5      2         1      a    NaN
1       Cranes  4.0      4         1      b    NaN
2      plovers  1.5      3         0      c    NaN
3   spoonbills  NaN      4         1      d    NaN
4   spoonbills  6.0      3         0      e    NaN
5       Cranes  3.0      4         0      f    NaN
6      Plovers  5.5      2         0      g    NaN
7       Cranes  NaN      2         1      h    NaN
8   Spoonbills  8.0      3         0      i    NaN
9   spoonbills  4.0      2         0      j    NaN
10      rabbit  3.0      4         1    NaN      k